app/Controllers/UserController.php

    public function index()
    {

        $data['title']="Inicio de Sesión";
        $validation =  \Config\Services::validation();
            if (strtolower($this->request->getMethod()) === 'get'){
                return
                view('common/head') .
                view('usuarios/login') .
                view('common/footer');
            }

            $rules = [
                'text' => 'required',
                'password'=>'required'
            ];

            if (! $this->validate($rules)) {
                return
                view('common/head') .
                view('usuarios/login') .
                view('common/footer');
            }
            else{
                $email = $_POST['text'];
                $password = $_POST['password'];
                $userModel = model('UserModel');
                $data['usuario']= $userModel->like('email',$email)
                                ->Like('contraseña',$password)
                                ->findAll();
---
SELECT *
FROM `usuarios`
WHERE `email` LIKE '%MauriHdz%' ESCAPE '!'
AND  `contraseña` LIKE '%1234%' ESCAPE '!'